examples/flows/compiled/while_break_continue/flow.mmd
flowchart TD
    %% Flow: while_break_continue_flow

    end_while_break_continue_flow([end_while_break_continue_flow])
    handler_check[handler_check]
    handler_finalize[handler_finalize]
    handler_init[handler_init]
    handler_process[handler_process]
    router_while_break_continue_flow_line_13_seq_5{{router_while_break_continue_flow_line_13_seq_5}}
    router_while_break_continue_flow_line_14_while_1{{router_while_break_continue_flow_line_14_while_1}}
    router_while_break_continue_flow_line_15_seq_4{{router_while_break_continue_flow_line_15_seq_4}}
    router_while_break_continue_flow_line_17_if_3{{router_while_break_continue_flow_line_17_if_3}}
    router_while_break_continue_flow_line_20_if_2{{router_while_break_continue_flow_line_20_if_2}}
    start_while_break_continue_flow([start_while_break_continue_flow])

    start_while_break_continue_flow --> handler_init
    start_while_break_continue_flow --> router_while_break_continue_flow_line_13_seq_5
    router_while_break_continue_flow_line_20_if_2 -->|p['stop']| handler_finalize
    router_while_break_continue_flow_line_17_if_3 -->|p['skip']| router_while_break_continue_flow_line_14_while_1
    router_while_break_continue_flow_line_17_if_3 -->|not (p['skip'])| handler_process
    router_while_break_continue_flow_line_17_if_3 -->|not (p['skip'])| router_while_break_continue_flow_line_20_if_2
    router_while_break_continue_flow_line_15_seq_4 --> handler_check
    router_while_break_continue_flow_line_15_seq_4 --> router_while_break_continue_flow_line_17_if_3
    router_while_break_continue_flow_line_14_while_1 -->|p['i'] < p['max_iterations']| router_while_break_continue_flow_line_15_seq_4
    router_while_break_continue_flow_line_14_while_1 -->|p['i'] < p['max_iterations']| router_while_break_continue_flow_line_14_while_1
    router_while_break_continue_flow_line_14_while_1 -->|not (p['i'] < p['max_iterations'])| handler_finalize
    router_while_break_continue_flow_line_13_seq_5 --> router_while_break_continue_flow_line_14_while_1
